# Introduction to Pandas

Pandas = **Pan**el **Da**ta

![PandasURL](https://upload.wikimedia.org/wikipedia/commons/5/54/Chengdu-pandas-d10.jpg "pandas")

Python's Pandas module is a great library to work with tabular data (i.e. data which can be represented by a table with rows and columns). It is one of the most widely used tools for data wrangling.

## Getting Started: Install & Import
Python is an open source library. In order to use it, you need to *import* it first (similar to how you imported functions previously).

In [1]:
import pandas as pd  # note the alias 'pd'
import numpy as np

**Importing a library:** loading it into memory so you can use it in your script.

Note the use of the aliases `pd` and `np`. This means that when accessing the Pandas library, we abbreviate `pandas` to `pd` (e.g. instead of saying `pandas.DataFrame()`, we shorten it to `pd.DataFrame()`). 

Furthermore, Python 2.7 is a pre-requirement and Pandas is also dependent on [Numpy](https://numpy.org/) (which is a library for scientific computing but we will not cover this here today!)

If that didn't work, you'll have to install it on your terminal through `conda install pandas` or `pip install pandas`.

In [21]:
!pip install pandas

Traceback (most recent call last):
  File "/opt/conda/bin/pip", line 7, in <module>
    from pip._internal import main
ModuleNotFoundError: No module named 'pip._internal'

## Pandas Data Structures
There are two main types of data structures in pandas:
* **Series:** A one-dimensional data structure (basically a vector that can hold any data type with the labels of the each row as index).
* **DataFrame:** A multi-dimensional data structure. A two dimensional data frame is simply a table but it can be more than two dimensional.

In [5]:
# example Series (don't worry about syntax)
ser = pd.Series(data = [1, 5, 12, 'random number', 100, 10000, 0])
ser

0                1
1                5
2               12
3    random number
4              100
5            10000
6                0
dtype: object

In [6]:
# example DataFrame (don't worry about syntax)
df = pd.DataFrame(data={'person': ['Jo', 'John', 'Mary', 'Tim'], 'age': [28, 35, 50, 18]})
df

  person  age
0     Jo   28
1   John   35
2   Mary   50
3    Tim   18

As you can see, we have created a series and a data frame (with columns named *person* and *age* indexed 0 to 3). This makes data manipulation and analysis more intuitive as we're used to handling tables.

We will mainly focus on two dimensional data frames as they are much more common.

**So how can you create a Data Frame?**

There are many different ways data frames can be created. Pandas is very flexible as you can easily convert existing objects to data frames (e.g. dictionaries, arrays, lists etc.), import data (e.g. from CSVs or JSON) or connect to an SQL database (more information on how to connect to S3 buckets on the [AP guidance](https://moj-analytical-services.github.io/platform_user_guidance/amazon-s3.html#download-or-read-files-from-amazon-s3).

We will go through a few common examples. If you want to turn something into a data frame that isn't on here, there is likely a way and a quick Google should show you!

## Creating a data frame from scratch
The basic command to do so is `pd.DataFrame()` ([link](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html) to documentation). Like a function, it can take several arguments to help define the data frame. Without any arguments, an empty data frame is created as such:

In [7]:
df_empty = pd.DataFrame()
df_empty

Empty DataFrame
Columns: []
Index: []

Let's have some data! A dictionary can easily be translated to a data frame.

In [8]:
fruit = {'apples': [3, 2, 0, 1], 'oranges': [0, 3, 7, 2]}
fruit

{'apples': [3, 2, 0, 1], 'oranges': [0, 3, 7, 2]}

In [9]:
# converting a dictionary
df_fruit = pd.DataFrame(data=fruit)
display(df_fruit)

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

The different arguments allow you to customise your data frame. For instance, we can add customer names as our index.

In [10]:
customers = ['Jo', 'Megan', 'Karik', 'Sam']
df_fruit = pd.DataFrame(fruit, index=customers)
df_fruit

       apples  oranges
Jo          3        0
Megan       2        3
Karik       0        7
Sam         1        2

**Exercise**: We've just converted a dictionary to a data frame. There are many objects you can convert, even those that are not native to Python. For instance, convert the array below to a data frame.

In [11]:
rand_array = np.random.randint(10, size=(3, 4))
rand_array

array([[1, 2, 2, 9],
       [9, 1, 0, 3],
       [6, 1, 4, 4]])

In [ ]:
df_array = ??

What if you want the columns to be named 'a','b','c' and 'd'?

Tip: look at the possible arguments using `?pd.DataFrame`

In [12]:
?pd.DataFrame

Init signature: pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
Docstring:
Two-dimensional size-mutable, potentially heterogeneous tabular data
structure with labeled axes (rows and columns). Arithmetic operations
align on both row and column labels. Can be thought of as a dict-like
container for Series objects. The primary pandas data structure.

Parameters
----------
data : numpy ndarray (structured or homogeneous), dict, or DataFrame
    Dict can contain Series, arrays, constants, or list-like objects

    .. versionchanged :: 0.23.0
       If data is a dict, argument order is maintained for Python 3.6
       and later.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided
columns : Index or array-like
    Column labels to use for resulting frame. Will default to
    RangeIndex (0, 1, 2, ..., n) if no column labels are provided
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer
copy : boolean, default False
    Copy data from inputs. Only affects DataFrame / 2d ndarray input

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.random.randint(low=0, high=10, size=(5, 5)),
...                    columns=['a', 'b', 'c', 'd', 'e'])
>>> df2
    a   b   c   d   e
0   2   8   8   3   4
1   4   2   9   0   9
2   1   0   7   8   0
3   5   1   7   1   3
4   6   0   2   4   2

See also
--------
DataFrame.from_records : constructor from tuples, also record arrays
DataFrame.from_dict : from dicts of Series, arrays, or dicts
DataFrame.from_items : from sequence of (key, value) pairs
pandas.read_csv, pandas.read_table, pandas.read_clipboard
File:           /opt/conda/lib/python3.6/site-packages/pandas/core/frame.py
Type:           type

## Reading and saving data
To import data from a file, most pandas commands are named according to the file type you are trying to import following this syntax `pd.read_filetype(filepath)`. For instance:
* `pd.read_csv('fruit_purchases.csv')` for CSV files
* `pd.read_json('fruit_purchases.csv')` for JSON files (JavaScript Object Notation)
* etc.

Similarly, to save a data frame `df`, simply use `df.to_filetype(filename)`:
* `df.to_csv('myfile')` for CSV files
* etc.

Each command to read in different data types will have different subtleties in the arguments you choose. For example, `pd.read_csv()` allows you to choose the delimiter type or whether to use the first row as the column names or not. Another example is that if your first column contains the names of the customers and you would like that to be the index, you can use `index_col=0`. The arguments for each can be found in the [Pandas documentation](https://pandas.pydata.org/pandas-docs/stable/reference/io.html).

We won't go through each file type but we will try one example and subsequently work with this data.

In [13]:
# Create URL to JSON file (alternatively this can be a filepath)
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

# Load the first sheet of the JSON file into a data frame
df = pd.read_json(url)
df

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0
11        5 2015-01-01 00:00:11         0
12        8 2015-01-01 00:00:12         0
13        9 2015-01-01 00:00:13         0
14        8 2015-01-01 00:00:14         0
15        8 2015-01-01 00:00:15         0
16        2 2015-01-01 00:00:16         0
17        1 2015-01-01 00:00:17         0
18        4 2015-01-01 00:00:18         0
19        8 2015-01-01 00:00:19         0
2         9 2015-01-01 00:00:02         0
20        9 2015-01-01 00:00:20         0
21        5 2015-01-01 00:00:21         0
22        4 2015-01-01 00:00:22         0
23        8 2015-01-01 00:00:23         0
24        6 2015-01-01 00:00:24         0
25        4 2015-01-01 00:00:25         0
26        5 2015-01-01 00:00:26         0
27        6 2015-01-01 00:00:27         0
28        3 2015-01-01 00:00:28         0
29        7 2015-01-01 00:00:29         0
3         6 2015-01-01 00:00:03         0
30        9 2015-01-01 00:00:30         0
31        8 2015-01-01 00:00:31         0
32        8 2015-01-01 00:00:32         0
33        4 2015-01-01 00:00:33         0
34        8 2015-01-01 00:00:34         0
35        2 2015-01-01 00:00:35         0
..      ...                 ...       ...
72        4 2015-01-01 00:01:12         0
73        9 2015-01-01 00:01:13         0
74        9 2015-01-01 00:01:14         0
75        8 2015-01-01 00:01:15         0
76        9 2015-01-01 00:01:16         0
77        1 2015-01-01 00:01:17         0
78        1 2015-01-01 00:01:18         0
79        7 2015-01-01 00:01:19         0
8         6 2015-01-01 00:00:08         0
80        1 2015-01-01 00:01:20         0
81        7 2015-01-01 00:01:21         0
82        1 2015-01-01 00:01:22         0
83        1 2015-01-01 00:01:23         0
84        4 2015-01-01 00:01:24         0
85        8 2015-01-01 00:01:25         0
86        6 2015-01-01 00:01:26         0
87        1 2015-01-01 00:01:27         0
88        2 2015-01-01 00:01:28         0
89        8 2015-01-01 00:01:29         0
9         9 2015-01-01 00:00:09         0
90        1 2015-01-01 00:01:30         0
91        5 2015-01-01 00:01:31         0
92        7 2015-01-01 00:01:32         0
93        9 2015-01-01 00:01:33         0
94        5 2015-01-01 00:01:34         0
95        9 2015-01-01 00:01:35         0
96        8 2015-01-01 00:01:36         0
97        6 2015-01-01 00:01:37         0
98        8 2015-01-01 00:01:38         0
99        1 2015-01-01 00:01:39         0

[100 rows x 3 columns]

We have created a DataFrame called `df`. Notice how the index labels are not ordered (this is just how the guy defined his data in the JSON file).

**Methods**

To call functions (called methods) associated to `df`, we simply use the syntax `df.method()`. These methods allow us to *do stuff* to the data frame. They are functions that can only be used on `df`. To see the list of methods available, you can type `df.` and then click *tab* on your keyboard. You can then start typing to see what the drop down filters.

In [ ]:
# try it here
df.

## Viewing and inspecting the data

Let's display a sample of the table we imported.
* `df.head(n)` will select the first n rows.
* `df.tail(n)` will select the last n rows.
* `df.sample(n)` will select a random sample of size n.

In [14]:
df.head(3)

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0

In [15]:
df.tail(3)

    integer            datetime  category
97        6 2015-01-01 00:01:37         0
98        8 2015-01-01 00:01:38         0
99        1 2015-01-01 00:01:39         0

In [16]:
# note that refreshing this will change the sample every time
# the seed can be fixed
df.sample(3)

    integer            datetime  category
77        1 2015-01-01 00:01:17         0
11        5 2015-01-01 00:00:11         0
39        3 2015-01-01 00:00:39         0

Some useful methods to explore the data include:

In [17]:
# gives index, datatype of each column and memory information
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 99
Data columns (total 3 columns):
integer     100 non-null int64
datetime    100 non-null datetime64[ns]
category    100 non-null int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 3.1 KB

In [18]:
# gives rows x columns (note that there are no paranthesis - don't ask me why)
df.shape

(100, 3)

In [19]:
# summary stats of the numerical columns
df.describe()

          integer  category
count  100.000000     100.0
mean     5.500000       0.0
std      2.634273       0.0
min      1.000000       0.0
25%      4.000000       0.0
50%      6.000000       0.0
75%      8.000000       0.0
max      9.000000       0.0

**Exercise**

Find the following:

In [57]:
# median of numerical columns

integer     5.5
category    0.0
dtype: float64

In [ ]:
# sum of numerical columns

In [80]:
# count number of missing values
# tip: see what happens if you type df.isnull()

## Common methods for data manipulation

The previous methods help you eyeball your data. Some other really useful methods include the following:

In [17]:
# append a dataframe at the bottom of the other
temp_df = df.append(df)
temp_df.shape

(200, 3)

In [18]:
# removing duplicates
temp_df = temp_df.drop_duplicates()
temp_df.shape

(100, 3)

In [19]:
# printing column names
df.columns

Index(['integer', 'datetime', 'category'], dtype='object')

In [47]:
# renaming columns
df = df.rename(columns = {'integer': 'number'})
df.columns

Index(['number', 'datetime', 'category'], dtype='object')

In [21]:
# getting rid of missing values (axis = 0 is rows, 1 is columns)
df = df.dropna()
df.shape

(100, 3)

## Data Frame slicing (selecting and extracting)
Slicing basically means selecting a subset

**Selecting by column**

To select one column, we use the following syntax `df[column_name]`. This will return a Series (A dataframe is in fact a collection of labelled series). For instance:

In [20]:
cat_col = df['category']
display(cat_col.head())
print(type(cat_col))

0     0
1     0
10    0
11    0
12    0
Name: category, dtype: int64

<class 'pandas.core.series.Series'>

To extract a column as a Data Frame, you need to pass a list of column names using the following syntax: `df[list_of_columns]`. In this case, it's a single column:

In [27]:
# let's only display the first 5 entries of our result (5 is the default)
# Note that you pass a LIST of columns hence the brackets inside the 'slicing' brackets
cat_df = df[['category']]
display(cat_df.head())
print(type(cat_df))

    category
0          0
1          0
10         0
11         0
12         0

<class 'pandas.core.frame.DataFrame'>

In [28]:
# If you did this with only one column, there would be no error and you would get a series instead!
cat_df = df['category']
display(cat_df.head())
print(type(cat_df))

0     0
1     0
10    0
11    0
12    0
Name: category, dtype: int64

<class 'pandas.core.series.Series'>

In [29]:
# You cannot get a series with several columns so the list is always needed when several columns are selected
df[['datetime', 'category']].head()

              datetime  category
0  2015-01-01 00:00:00         0
1  2015-01-01 00:00:01         0
10 2015-01-01 00:00:10         0
11 2015-01-01 00:00:11         0
12 2015-01-01 00:00:12         0

**Side note:** You can use the same methods as before to inspect specific columns or series. The outputs look different because in one case, it is looking at the mean of all numerical columns of a dataframe, in the other, it is outputting the mean of a series.

In [30]:
print('Treating this as a data frame:', df[['category']].mean())
print('')
print('Treating this as a series:', df['category'].mean())

Treating this as a data frame: category    0.0
dtype: float64

Treating this as a series: 0.0

Note that there are often plenty of ways to do one thing, it just depends on what you prefer, what is more efficient etc. For example, instead of selecting all but one column, you can simply drop that column.

In [31]:
df.drop(columns=['datetime']).head(5)

    integer  category
0         5         0
1         5         0
10        5         0
11        5         0
12        8         0

**Selecting by rows**

* index position `df.iloc[0]`
* index name `df.loc['index_name']`

In [32]:
df.iloc[10]

integer                       4
datetime    2015-01-01 00:00:18
category                      0
Name: 18, dtype: object

In [33]:
df.loc[10]

integer                       5
datetime    2015-01-01 00:00:10
category                      0
Name: 10, dtype: object

See how simply changing between `.iloc` and `.loc` can give different results. This can be a big source of confusion and can lead to errors! In this case:
* `df.iloc[10]` gives the 10th row
* `df.loc[10]` gives the row whose index is named 10.

In [34]:
# We define a different dataframe where we sort the index
df_s = df.sort_index()
df_s.head()

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
2        9 2015-01-01 00:00:02         0
3        6 2015-01-01 00:00:03         0
4        6 2015-01-01 00:00:04         0

In [35]:
# compared to df
df.head()

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0
11        5 2015-01-01 00:00:11         0
12        8 2015-01-01 00:00:12         0

Since it is now sorted and the index names incrementally increases by 1, both the index position and the index name should match!

In [36]:
df_s.iloc[10]

integer                       5
datetime    2015-01-01 00:00:10
category                      0
Name: 10, dtype: object

In [37]:
df_s.loc[10]

integer                       5
datetime    2015-01-01 00:00:10
category                      0
Name: 10, dtype: object

On the topic of sorting, Pandas data frames have a more generic method to sort: `df.sort_values()`. It has various arguments you can look into to personalise how you sort things (e.g. ascending/descending, columns/index etc.) but you can look up the documentation for that.

To select several rows, you can use the colon `:` symbol.

In [38]:
# this selects from index 0 to 2 (excluded)
df.iloc[0:2]

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0

In [39]:
# This can also be written as
df.iloc[:2]

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0

Note the difference with `.loc`: this returns the rows between those labelled 0 and 2 (inclusive).

In [40]:
df.loc[0:2]

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0
11        5 2015-01-01 00:00:11         0
12        8 2015-01-01 00:00:12         0
13        9 2015-01-01 00:00:13         0
14        8 2015-01-01 00:00:14         0
15        8 2015-01-01 00:00:15         0
16        2 2015-01-01 00:00:16         0
17        1 2015-01-01 00:00:17         0
18        4 2015-01-01 00:00:18         0
19        8 2015-01-01 00:00:19         0
2         9 2015-01-01 00:00:02         0

**Selecting by rows AND columns**

Using a combination of the above, we can select rows and columns. Using `.loc` and `.iloc`, we can also select specific columns. The order usually follows the logic of \[rows, columns\].

In [48]:
# selects first row and first column
df.iloc[0, 0]

5

In [49]:
# selects row with index named '10' and column named 'category'
df.loc[10, 'category']

0

In [50]:
df.loc[10,['datetime', 'category']]

datetime    2015-01-01 00:00:10
category                      0
Name: 10, dtype: object

In [51]:
# you can use a mixture of both by using what we've learned
# selects the first two rows with columns named 'integer' and 'category'
df[['datetime', 'category']].iloc[0:2]

             datetime  category
0 2015-01-01 00:00:00         0
1 2015-01-01 00:00:01         0

**Exercise**
* Select the first row and first column
* Select the last row and all columns (tip: -1 is for last)

## Filtering

The concept of *slicing* can be extended to filtering a data frame by the value of the rows in that column. 

First though, let's understand Booleans.

In [53]:
#look at numbers greater or equal to 5
n_5 = df['number']>=5
n_5.head(10)

0      True
1      True
10     True
11     True
12     True
13     True
14     True
15     True
16    False
17    False
Name: number, dtype: bool

The Series `n_5` contains True/False values for each row against the condition `>=5` (note its name `number`). Since these are boolean values, it is the equivalent of 1 and 0 so we can see how many rows met the condition:

In [54]:
print('Number of True:', sum(n_5))

Number of True: 66

Why does this matter? Well, these boolean values are what we *pass* to the data frame so it knows to filter on the `True` values. This is where the slicing syntax `df[boolean_values]` comes into play.

In [55]:
df_5 = df[n_5]
display(df_5.head(10))
print(df_5.shape)

    number            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
10       5 2015-01-01 00:00:10         0
11       5 2015-01-01 00:00:11         0
12       8 2015-01-01 00:00:12         0
13       9 2015-01-01 00:00:13         0
14       8 2015-01-01 00:00:14         0
15       8 2015-01-01 00:00:15         0
19       8 2015-01-01 00:00:19         0
2        9 2015-01-01 00:00:02         0

(66, 3)

As you can see, it used the series `n_5` to filter on the column `number`, leaving us with 66 rows. A syntax I tend to use more (and I have seen more) to do the same thing is:

In [56]:
# we skip the step of creating a new series n_5 and simply do it in one
df[df['number']>=5]

    number            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
10       5 2015-01-01 00:00:10         0
11       5 2015-01-01 00:00:11         0
12       8 2015-01-01 00:00:12         0
13       9 2015-01-01 00:00:13         0
14       8 2015-01-01 00:00:14         0
15       8 2015-01-01 00:00:15         0
19       8 2015-01-01 00:00:19         0
2        9 2015-01-01 00:00:02         0
20       9 2015-01-01 00:00:20         0
21       5 2015-01-01 00:00:21         0
23       8 2015-01-01 00:00:23         0
24       6 2015-01-01 00:00:24         0
26       5 2015-01-01 00:00:26         0
27       6 2015-01-01 00:00:27         0
29       7 2015-01-01 00:00:29         0
3        6 2015-01-01 00:00:03         0
30       9 2015-01-01 00:00:30         0
31       8 2015-01-01 00:00:31         0
32       8 2015-01-01 00:00:32         0
34       8 2015-01-01 00:00:34         0
38       8 2015-01-01 00:00:38         0
4        6 2015-01-01 00:00:04         0
40       5 2015-01-01 00:00:40         0
44       6 2015-01-01 00:00:44         0
46       6 2015-01-01 00:00:46         0
5        9 2015-01-01 00:00:05         0
50       5 2015-01-01 00:00:50         0
51       7 2015-01-01 00:00:51         0
..     ...                 ...       ...
59       8 2015-01-01 00:00:59         0
6        7 2015-01-01 00:00:06         0
62       9 2015-01-01 00:01:02         0
64       7 2015-01-01 00:01:04         0
65       7 2015-01-01 00:01:05         0
66       7 2015-01-01 00:01:06         0
67       9 2015-01-01 00:01:07         0
68       5 2015-01-01 00:01:08         0
69       5 2015-01-01 00:01:09         0
70       5 2015-01-01 00:01:10         0
71       8 2015-01-01 00:01:11         0
73       9 2015-01-01 00:01:13         0
74       9 2015-01-01 00:01:14         0
75       8 2015-01-01 00:01:15         0
76       9 2015-01-01 00:01:16         0
79       7 2015-01-01 00:01:19         0
8        6 2015-01-01 00:00:08         0
81       7 2015-01-01 00:01:21         0
85       8 2015-01-01 00:01:25         0
86       6 2015-01-01 00:01:26         0
89       8 2015-01-01 00:01:29         0
9        9 2015-01-01 00:00:09         0
91       5 2015-01-01 00:01:31         0
92       7 2015-01-01 00:01:32         0
93       9 2015-01-01 00:01:33         0
94       5 2015-01-01 00:01:34         0
95       9 2015-01-01 00:01:35         0
96       8 2015-01-01 00:01:36         0
97       6 2015-01-01 00:01:37         0
98       8 2015-01-01 00:01:38         0

[66 rows x 3 columns]

Using the same logic, we can filter on several conditions with boolean operators `&`, `|`.

In [57]:
import datetime

In [58]:
# to avoid errors, always use brackets around each condition!!
df[(df['number']==8) & (df['datetime']>=datetime.datetime(2015, 1, 1, 0, 1, 0))]

    number            datetime  category
71       8 2015-01-01 00:01:11         0
75       8 2015-01-01 00:01:15         0
85       8 2015-01-01 00:01:25         0
89       8 2015-01-01 00:01:29         0
96       8 2015-01-01 00:01:36         0
98       8 2015-01-01 00:01:38         0

**Exercise:**
* Select rows where the number column is equal to 7 **OR** the category column is equal to 1.
* Select rows where the number column is equal to 7 **AND** the category column is equal to 1.

Basically, you can use anything that returns a Series of booleans to filter your dataframe. More examples:

In [59]:
df[df['number'].notnull()]

    number            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
10       5 2015-01-01 00:00:10         0
11       5 2015-01-01 00:00:11         0
12       8 2015-01-01 00:00:12         0
13       9 2015-01-01 00:00:13         0
14       8 2015-01-01 00:00:14         0
15       8 2015-01-01 00:00:15         0
16       2 2015-01-01 00:00:16         0
17       1 2015-01-01 00:00:17         0
18       4 2015-01-01 00:00:18         0
19       8 2015-01-01 00:00:19         0
2        9 2015-01-01 00:00:02         0
20       9 2015-01-01 00:00:20         0
21       5 2015-01-01 00:00:21         0
22       4 2015-01-01 00:00:22         0
23       8 2015-01-01 00:00:23         0
24       6 2015-01-01 00:00:24         0
25       4 2015-01-01 00:00:25         0
26       5 2015-01-01 00:00:26         0
27       6 2015-01-01 00:00:27         0
28       3 2015-01-01 00:00:28         0
29       7 2015-01-01 00:00:29         0
3        6 2015-01-01 00:00:03         0
30       9 2015-01-01 00:00:30         0
31       8 2015-01-01 00:00:31         0
32       8 2015-01-01 00:00:32         0
33       4 2015-01-01 00:00:33         0
34       8 2015-01-01 00:00:34         0
35       2 2015-01-01 00:00:35         0
..     ...                 ...       ...
72       4 2015-01-01 00:01:12         0
73       9 2015-01-01 00:01:13         0
74       9 2015-01-01 00:01:14         0
75       8 2015-01-01 00:01:15         0
76       9 2015-01-01 00:01:16         0
77       1 2015-01-01 00:01:17         0
78       1 2015-01-01 00:01:18         0
79       7 2015-01-01 00:01:19         0
8        6 2015-01-01 00:00:08         0
80       1 2015-01-01 00:01:20         0
81       7 2015-01-01 00:01:21         0
82       1 2015-01-01 00:01:22         0
83       1 2015-01-01 00:01:23         0
84       4 2015-01-01 00:01:24         0
85       8 2015-01-01 00:01:25         0
86       6 2015-01-01 00:01:26         0
87       1 2015-01-01 00:01:27         0
88       2 2015-01-01 00:01:28         0
89       8 2015-01-01 00:01:29         0
9        9 2015-01-01 00:00:09         0
90       1 2015-01-01 00:01:30         0
91       5 2015-01-01 00:01:31         0
92       7 2015-01-01 00:01:32         0
93       9 2015-01-01 00:01:33         0
94       5 2015-01-01 00:01:34         0
95       9 2015-01-01 00:01:35         0
96       8 2015-01-01 00:01:36         0
97       6 2015-01-01 00:01:37         0
98       8 2015-01-01 00:01:38         0
99       1 2015-01-01 00:01:39         0

[100 rows x 3 columns]

In [60]:
# this won't work
df[5<df['number']<8]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [61]:
# but this will
df[(df['number']>5) & (df['number']<8)]

    number            datetime  category
24       6 2015-01-01 00:00:24         0
27       6 2015-01-01 00:00:27         0
29       7 2015-01-01 00:00:29         0
3        6 2015-01-01 00:00:03         0
4        6 2015-01-01 00:00:04         0
44       6 2015-01-01 00:00:44         0
46       6 2015-01-01 00:00:46         0
51       7 2015-01-01 00:00:51         0
55       6 2015-01-01 00:00:55         0
56       6 2015-01-01 00:00:56         0
6        7 2015-01-01 00:00:06         0
64       7 2015-01-01 00:01:04         0
65       7 2015-01-01 00:01:05         0
66       7 2015-01-01 00:01:06         0
79       7 2015-01-01 00:01:19         0
8        6 2015-01-01 00:00:08         0
81       7 2015-01-01 00:01:21         0
86       6 2015-01-01 00:01:26         0
92       7 2015-01-01 00:01:32         0
97       6 2015-01-01 00:01:37         0

# Modifying data frames

Let's say we want to change the value of a field e.g. the first entry of the first column.

In [62]:
print('value before:', df.iloc[0,0])
df.iloc[0,0]=6
print('value after:', df.iloc[0,0])

value before: 5
value after: 6

In [63]:
# replace a full column
df['category']=1
df.head()

    number            datetime  category
0        6 2015-01-01 00:00:00         1
1        5 2015-01-01 00:00:01         1
10       5 2015-01-01 00:00:10         1
11       5 2015-01-01 00:00:11         1
12       8 2015-01-01 00:00:12         1

How about adding a new column?

In [64]:
df['stuff'] = 5
df.head()

    number            datetime  category  stuff
0        6 2015-01-01 00:00:00         1      5
1        5 2015-01-01 00:00:01         1      5
10       5 2015-01-01 00:00:10         1      5
11       5 2015-01-01 00:00:11         1      5
12       8 2015-01-01 00:00:12         1      5

But what if we want to do something more intelligent operations?

In [65]:
# create a column based on another one
df['half_number'] = df['number']/2
df.head()

    number            datetime  category  stuff  half_number
0        6 2015-01-01 00:00:00         1      5          3.0
1        5 2015-01-01 00:00:01         1      5          2.5
10       5 2015-01-01 00:00:10         1      5          2.5
11       5 2015-01-01 00:00:11         1      5          2.5
12       8 2015-01-01 00:00:12         1      5          4.0

In [66]:
df['random_stuff'] = df['stuff'] + np.random.random()
df.head()

    number            datetime  category  stuff  half_number  random_stuff
0        6 2015-01-01 00:00:00         1      5          3.0      5.040104
1        5 2015-01-01 00:00:01         1      5          2.5      5.040104
10       5 2015-01-01 00:00:10         1      5          2.5      5.040104
11       5 2015-01-01 00:00:11         1      5          2.5      5.040104
12       8 2015-01-01 00:00:12         1      5          4.0      5.040104

Hmmm... this did not work. It added the same random number to the column `stuff`. This is because it generates a random number once and applies it to all. To generate a new one for each row, we use `df.apply` (note that like many Python things, there are various ways of doing the same task but we will only cover this one for now).

In [67]:
def add_rand(x):
    return x + np.random.random()

In [68]:
df['stuff'].apply(add_rand).head()

0     5.871841
1     5.689787
10    5.776139
11    5.656899
12    5.868474
Name: stuff, dtype: float64

This allows us to iterate the function `add_rand` over the column `stuff`. Another syntax to achieve the same thing is:

In [69]:
# don't ask me about why the syntax is as is...
df['stuff'].apply(lambda x: x + np.random.random()).head()

0     5.876610
1     5.421781
10    5.393199
11    5.396279
12    5.926785
Name: stuff, dtype: float64

You can either use an existing Python function (e.g. `len` to count the number of characters), a function you created yourself (e.g. `add_rand`) or use the `lambda x` syntax.

Here, `.apply()` is being used as a series method. It just iterates over all the rows of the Series. It also exists as a data frame method which allows you to do more advanced things like combining two columns to give a third with some intelligent function. There are a few resources online that cover this e.g.:
* https://www.ritchieng.com/pandas-apply/
* http://jonathansoma.com/lede/foundations/classes/pandas%20columns%20and%20functions/apply-a-function-to-every-row-in-a-pandas-dataframe/

(If you have any better ones, please let me know!)

# Copies...

We've modified data frames above but let's look at this...

In [70]:
# let's create a filtered data frame df_f
df_f = df[df['number']==5]
df_f.head()

    number            datetime  category  stuff  half_number  random_stuff
1        5 2015-01-01 00:00:01         1      5          2.5      5.040104
10       5 2015-01-01 00:00:10         1      5          2.5      5.040104
11       5 2015-01-01 00:00:11         1      5          2.5      5.040104
21       5 2015-01-01 00:00:21         1      5          2.5      5.040104
26       5 2015-01-01 00:00:26         1      5          2.5      5.040104

In [71]:
# let's modify this filtered data frame
df_f['new'] = 'new'
df_f.head()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,number,datetime,category,stuff,half_number,random_stuff,new
1,5,2015-01-01 00:00:01,1,5,2.5,5.040104,new
10,5,2015-01-01 00:00:10,1,5,2.5,5.040104,new
11,5,2015-01-01 00:00:11,1,5,2.5,5.040104,new
21,5,2015-01-01 00:00:21,1,5,2.5,5.040104,new
26,5,2015-01-01 00:00:26,1,5,2.5,5.040104,new

What is this warning about?

This warning comes up when it thinks you might be working on a copy of the original dataframe rather than the view. Indeed, after filtering df, we ended up creating a copy of the subset and stored it in df_f. It means that when modifying df_f, we do not modify df.

In [72]:
print('df_f columns:', df_f.columns)
print('df columns remain unchanged:', df.columns)

df_f columns: Index(['number', 'datetime', 'category', 'stuff', 'half_number',
       'random_stuff', 'new'],
      dtype='object')
df columns remain unchanged: Index(['number', 'datetime', 'category', 'stuff', 'half_number',
       'random_stuff'],
      dtype='object')

This may seem unnecessary to point out but here are examples where it matters!

In [73]:
# let's take our fruit example
df_fruit

       apples  oranges
Jo          3        0
Megan       2        3
Karik       0        7
Sam         1        2

In [74]:
# create a second identical one
df_fruit2 = df_fruit
print('Are they identical?', df_fruit == df_fruit2)

Are they identical?        apples  oranges
Jo       True     True
Megan    True     True
Karik    True     True
Sam      True     True

In [76]:
# Now, let's change something in df_fruit2
print('In df_fruit:', df_fruit.loc['Jo', 'oranges'])
print('In df_fruit2:', df_fruit2.loc['Jo', 'oranges'])

# Increment Jo's oranges by 1
df_fruit2.loc['Jo','oranges']+=1
print('In df_fruit2 after change:', df_fruit2.loc['Jo', 'oranges'])

In df_fruit: 1
In df_fruit2: 1
In df_fruit2 after change: 2

In [77]:
# but let's look at our original data frame...
print('In df_fruit:', df_fruit.loc['Jo', 'oranges'])

In df_fruit: 2

The original dataframe changed too?? This is because instead of creating a copy of df_fruit into df_fruit2, it created a *view* instead. It means that changing something to the view will change the original object too (and vice versa)!

This behaviour unfortunately can sometimes create problems and is linked to how `numpy` works (since `pandas` is built on top of it). For more information on it, this is the best resource I could find: https://www.practicaldatascience.org/html/views_and_copies_in_pandas.html

More generally, to avoid this problem, the best thing to do is to explicitly make copies of the original data frame using `.copy()` rather than hoping for the best... Let's re-run the same thing with a copy:

In [80]:
df_fruit2 = df_fruit.copy()
print('Are they identical?', df_fruit == df_fruit2)

Are they identical?        apples  oranges
Jo       True     True
Megan    True     True
Karik    True     True
Sam      True     True

In [81]:
# Now, let's change something in df_fruit2
print('In df_fruit:', df_fruit.loc['Jo', 'oranges'])
print('In df_fruit2:', df_fruit2.loc['Jo', 'oranges'])

# Increment by 1
df_fruit2.loc['Jo','oranges']+=1
print('In df_fruit2 after change:', df_fruit2.loc['Jo', 'oranges'])

In df_fruit: 1
In df_fruit2: 1
In df_fruit2 after change: 2

In [83]:
# let's look at our original data frame...
print('In df_fruit:', df_fruit.loc['Jo', 'oranges'])
print('Are they now still identical?', df_fruit == df_fruit2)

In df_fruit: 1
Are they now still identical?        apples  oranges
Jo       True    False
Megan    True     True
Karik    True     True
Sam      True     True

As you can see, the original data frame was not modified as a result of modifying `df_fruit2` because it was a copy rather than a view.

## The world is your oyster!

This was really the basics on how to get started with Pandas. We won't have time to cover other things but here are some useful resources:
* Group by: https://kanoki.org/2019/09/04/pandas-groupby-tutorial/
* Cross tab/pivot tables on data frames: https://kanoki.org/2019/07/24/how-to-create-pandas-pivot-table-and-crosstab/
* When your data is so large that Pandas starts to become slow, here are ways to deal with it: https://towardsdatascience.com/why-and-how-to-use-pandas-with-large-data-9594dda2ea4c
* We said that data frames could be more than two-dimensional. If you want to deal with multi-indexing, tables resulting from group by's are a good example

# Cheat sheets
If you're coming from R:
* `data.table` to `Pandas`: https://datascience-enthusiast.com/R/pandas_datatable.html
* ` dplyr` to `Pandas`: https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_r.html

More generic cheat sheets:
* https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf